//  Задание_01
let i1 = 1;
let n1 = Number(prompt('Сколько раз ввам сказать привет'));
while (i1<=n1) {
    console.log('Задание_01: Привет');
    i1++;
}


//  Задание_02
let i2 = 1;
while (i2 <= 5) {
    console.log (`Задание_02: ${i2}`);
    i2++;
}


//  Задание_03
let i3 = 7;
while (i3 <= 22) {
    console.log (`Задание_03: ${i3}`);
    i3++;
}


//  Задание_04
const obj = {
    'Коля': 200,
    'Вася': 300,
    'Петя': 400
};
for (let key in obj) {
    console.log ([key] + ' - зарплата ' + obj[key] + ' долларов.');
}


//  Задание_05
let n = 1000, i5 = 0;
while(n >= 50){
    n = n/2;
    i5++;
}
console.log("Интераций: " + i5 + ', получилось число ' + n);


//  Задание_06
let n6 = 1;
do {
    n6 = n6 + 7;
    if(n6 > 31) {
        break;
    }
    console.log (`Сегодня пятница, ${n6}-е число. Необходимо подготовить отчет.`);
}
while (n6 <= 31);
